"""Данный файл описывает проделанную работу."""

# 19/08 (2025)
#
# 1. Сделал форк репо Data-Science-For-Beginners-from-scratch-SENATOROV
# 2. Склонировал форкнутый репо на свой комп через GitHub Desktop
# 3. Открыл склонированный репо в Cursor через GitHub Desktop
# 4. В терминале в папке данного проекта ввел команды
# git init
# pip install pre-commit
# pre-commit install
# pre-commit run --all-files
# 5. Ознакомился с документацией по линтерам Pylint, Pydocstyle, Flake8 и Mypy
# 6. Выслал скрин своего терминала во Flood чат
# 7. Ознакомился с процедурой принятий и отправки домашних заданий

# 20/08 (2025)
#
# 1. Столкнулся с ошибкой nbqa-pydocstyle D100. Пересмотрел видео и поискал решение в HELP чате. Устранил ошибку путем вставки описания в отдельную первую ячейку (+Code)
#
